<a href="https://colab.research.google.com/github/sush0037/my-portfolio/blob/master/pandas_06sept25.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
ds=pd.Series()

In [ ]:
ds

Series([], dtype: object)

In [ ]:
l=[1,2,3]
myser = pd.Series(l)
myser

0    1
1    2
2    3
dtype: int64

In [ ]:
myser[1]

np.int64(2)

In [ ]:
l2=[10,11,12]
myser2 = pd.Series(l2,index=['a','b','c'])

In [ ]:
myser2

a    10
b    11
c    12
dtype: int64

In [ ]:
myser2["a"]

np.int64(10)

In [ ]:
l=['a','1']
ds=pd.Series(l)
ds

0    a
1    1
dtype: object

In [ ]:
s=pd.Series([10,20,30,40,50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
s.dtype
s.values
s.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
print(s.name)

None

In [ ]:
s.name="age"
s

0    10
1    20
2    30
3    40
4    50
Name: age, dtype: int64

In [ ]:
s[2]

np.int64(30)

In [ ]:
s[1:4]
s.iloc[3]

np.int64(40)

In [ ]:
s.iloc[[1,3,4]]

1    20
3    40
4    50
Name: age, dtype: int64

In [ ]:
index=["sad","good","mood","car","smart"]
s.index=index
s

sad      10
good     20
mood     30
car      40
smart    50
Name: age, dtype: int64

In [ ]:
s['sad']

np.int64(10)

In [ ]:
s.loc[['car','smart']]

car      40
smart    50
Name: age, dtype: int64